Revit 2026 API

# BuiltInFailuresImportExportFailures Class

---

Failures about Import and Export.

SystemObject Autodesk.Revit.DBBuiltInFailuresImportExportFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ImportExportFailures
```
```vb
Public NotInheritable Class ImportExportFailures
```
```cpp
public ref class ImportExportFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ImportExportFailures = class end
```

The BuiltInFailuresImportExportFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewBoundariesTooLarge | The view boundaries are too large to export the view.. |

#### Reference

Autodesk.Revit.DB Namespace